<?php

if (!defined('_ECRIRE_INC_VERSION')) return;

$GLOBALS[$GLOBALS['idx_lang']] = array(

// E
'escal_description' => 'Адаптирован для версии 3 SPIP и предлагает:
- * конфигурацию, осуществляемую в административной части;
- * настраиваемый макет в 2 или 3 колонки по выбору, со стилями;
- * управление многоязычием;
- * простой форум в стиле phpBB;
- * широкий выбор меню и навигации, некоторые являются избыточными: идентификация, меню по горизонтали и/или вертикали;
- * расположение, фон, цвет и содержание легко изменить в боковых блоках;
- * горизонтальное и/или вертикальное меню (2 на выбор) выпадающее на регулируемую глубину;
- * автоматическое перенаправление на статью, если она единственная в своей рубрике;
- * навигация по ключам;
- * календарь и/или список событий;
- * показ последних статей или объектов в рубрике;
- * показ подрубрик и статей на каждой странице рубрики;
- * показ форумов, связанных со статьями;
- * контактная форма для связи по электронной почте;
- * страница контактов;
- * карта сайта;
- * RSS-файл для синдикации сайта;
- * специальная таблица стилей для печати статей;
- * зона связи с домашней страницей (2 варианта просмотра);
- * валидный XHTML Strict 1.0',
'escal_slogan' => 'Шаблон в 2 или 3 колонки со множеством меню навигации и блоков',

);
?>