[(#REM)
	Un cache plus court, pour la boucle syndic_articles
]#CACHE{3600}
<!DOCTYPE html PUBLIC '-//W3C//DTD XHTML 1.0 Strict//EN' 'http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd'>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="#LANG" lang="#LANG" dir="#LANG_DIR">
<head>
<title>[(#NOM_SITE_SPIP|textebrut) - ] Les sites</title>
<INCLURE{fond=inc-head}>
</head>

<body class="page_sites">
<div id="page">

	[(#REM) Entete de la page + titre du site ]
	<INCLURE{fond=inc-entete}>

	[(#REM) Contenu principal : derniers articles publies ]
	<div class="hfeed" id="conteneur">
	<div id="contenu">
        [(#REM) Fil d'Ariane ]
        <div id="hierarchie"><a href="#URL_SITE_SPIP/" ><:accueil_site:></a> &gt; <:mentions:></div>


  <h3 class="spip">Mentions l&eacute;gales :</h3>
   <p>En vertu de la loi pour la confiance dans l'&eacute;conomie num&eacute;rique (LCEN) du 21 juin 2004, voici les coordonn&eacute;es de l'&eacute;diteur et du prestataire qui accueille le site : <br />
    <a href="#URL_SITE_SPIP">#URL_SITE_SPIP</a></p>

   [<p>Site Internet de : (#CONFIG{eva_mentions/structure})<br />]


   [<p>Directeur de la publication : (#CONFIG{eva_mentions/directeur})<br />]
   [Responsable d'&eacute;dition : (#CONFIG{eva_mentions/responsable})</p>]

   [<p>Prestataire assurant le stockage direct et permanent : (#CONFIG{eva_mentions/hebergeur})<br />]
        [Adresse : (#CONFIG{eva_mentions/adresse})</p>]

   <p>Webmestre : <a href="#URL_PAGE{auteur}&id_auteur=#CONFIG{eva_mentions/idwebmaster}">#CONFIG{eva_mentions/webmaster}</a><br />
   [Qualit&eacute; : (#CONFIG{eva_mentions/fonction})</a></p>]

  <h3 class="spip">Droits d'auteurs</h3>
   <p>Ce site rel&egrave;ve de la l&eacute;gislation française et internationale sur le droit d'auteur et la propri&eacute;t&eacute; intellectuelle.</p>
   <p>Tous les droits de reproduction sont r&eacute;serv&eacute;s.</p>

  <h3 class="spip">Liens hypertextes</h3>
   <p>Ce site contient des liens hypertextes permettant l'acc&egrave;s &agrave; des sites qui ne sont pas &eacute;dit&eacute;s par le responsable de ce site.</p>
   <p>En cons&eacute;quence le directeur de publication ne saurait être tenue pour responsable du contenu des sites auxquels l'internaute aurait ainsi acc&egrave;s.</p>
   <p>Il est formellement interdit de collecter et d’utiliser les informations disponibles sur le site &agrave; des fins commerciales.</p>
   <p>Cette interdiction s’&eacute;tend notamment, sans que cette liste ne soit limitative, &agrave; tout &eacute;l&eacute;ment r&eacute;dactionnel figurant sur le site, &agrave; la pr&eacute;sentation des &eacute;crans, aux logiciels n&eacute;cessaires &agrave; l’exploitation, aux logos, images, photos, graphiques, de quelque nature qu’ils soient.</p>

  <h3 class="spip">Liens hypertextes vers ce site</h3>
   <p>
   	A l'exception de sites diffusant des informations et/ou contenus ayant un caract&egrave;re ill&eacute;gal et/ou &agrave; caract&egrave;re politique, religieux, pornographique, x&eacute;nophobe, vous pouvez cr&eacute;er un lien hypertexte vers notre Site sur votre site.
   </p>
   <p>
   	La mise en place de lien hypertexte n’autorise en aucune façon la reproduction d’&eacute;l&eacute;ments du site ou la pr&eacute;sentation sur des sites tiers d’&eacute;l&eacute;ments du Site sous forme de Frame ou syst&egrave;me apparent&eacute;.
   </p>
   <p>
   	Enfin, la mise en place de lien hypertexte n’autorise en aucune façon de proposer l’envoi d’un message pr&eacute;-r&eacute;dig&eacute; &agrave; une adresse mail li&eacute;e au Site ou la mise en place d’un syst&egrave;me permettant l’envoi massif de messages quelle qu'en soit la nature.
   </p>
   <p>
   	Tous les droits de reproduction sont r&eacute;serv&eacute;s.
   </p>

[(#REM) Articles ayant le mot-cl&eacute; mentions]
<B_mentions>
	<BOUCLE_mentions(ARTICLES){titre_mot=mentions}>
			<h3 class="spip">[(#TITRE|supprimer_numero)]</h3>
			[<a href="#URL_ARTICLE" title="">(#LOGO_ARTICLE||reduire_image{120,70})</a>]
			[(#TEXTE)]
	</BOUCLE_mentions>
</B_mentions>

  <h3 class="spip">A propos de ce site</h3>

    <p>
    Ce site fonctionne avec SPIP et permet &agrave; une &eacute;cole ou &agrave; un &eacute;tablissement de mettre
    en place un site web collaboratif. Ce site utilise &eacute;galement quelques plugins
    (Eva Mentions, Agenda, Splickbox, Thickbox).
  	</p>
    <p>
    	L'habillage du site est fourni par un « squelette SPIP » d&eacute;velopp&eacute; par le CRDP de l'acad&eacute;mie de Versailles.
    	Ce squelette est issu du squelette de SPIP par d&eacute;fault (l&eacute;g&egrave;rement modifi&eacute;) et est
    	adapt&eacute; aux besoins des sites d'&eacute;tablissement.
    </p>
  	<p>
  		Pour plus de renseignements sur le projet, consultez le site Tice de l'acad&eacute;mie de Versailles :
  		<a href="http://www.tice.ac-versailles.fr/Squelette-etablissement.html" title="La page d'informations sur ce squelette">http://www.tice.ac-versailles.fr/Squelette-etablissement.html</a>
  	</p>
   	<p>
	   	Ce squelette est libre et distribu&eacute; sous Licence Publique G&eacute;n&eacute;rale
   		<a rel="licence" target="_blank" href="http://www.april.org/gnu/gpl_french.html">GNU (GNU General Public License ou GPL)</a>.
   	</p>


	</div><!--#contenu-->
	</div><!--#conteneur-->

    [(#REM) Menu de navigation laterale ]
    <div id="navigation">

        [(#REM) Menu de navigation par rubriques ]
        <INCLURE{fond=inc-rubriques}{id_rubrique}>


    </div><!--#navigation-->

    [(#REM) Menu de navigation laterale ]
    <div id="extra">


    </div><!--#extra-->

	[(#REM) Pied de page ]
	<INCLURE{fond=inc-pied}{skel=#SQUELETTE}>

</div><!--#page-->
</body>
</html>