<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Document sans nom</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<h1>Notice d'installation</h1>
<p>Cette notice est une aide &agrave; l'installation des templates
  SPIP de <a href="http://www.art-logic.info">www.art-logic.info</a>.<br>
  Les templates sont proches d'&ecirc;tre compl&egrave;tement termin&eacute;s. 95% pour Spip 1.8.3. <br>
  <strong>A ce jour les templates ne fonctionnent pas sous Spip 1.9.</strong></p>
<h3>Installation des templates: </h3>
<ul>
<li>Pour &ecirc;tre toujours &agrave; jour de la derni&egrave;re version, utilisez
  Tortoise.<br>
(Installez Tortoise sur votre ordinateur (voir <a href="http://zone.spip.org/trac/spip-zone/wiki/CommentUtiliserSvn">notice</a> sur
SPIP zone )</li>
  <li>Synchronisez vos dossiers avec Tortoise:<br>
A cette adresse svn, vous trouverez les anciens templates: <br>
svn://zone.spip.org/spip-zone/_squelettes_/_bloog_/bloog <br>
et ici les nouveaux templates qui remplacent les anciens: <br>
svn://zone.spip.org/spip-zone/_squelettes_/_bloog_/bloog_css<br>
  </li>
  <li>Ou trouvez les deux zip dans la zone de d&eacute;veloppement de BloOg.net. <br> 
  </li>
  <li>Installez tous les script de l'ancienne version.</li>
  <li>Ecrasez et remplacez les anciens templates par les nouveaux. </li>
  <li>Programmez les  nouveaux mots cl&eacute;s: <br>
    demandez un compte de r&eacute;dacteur
    sur Art-logic.info et  pompez-y les mots cl&eacute;s. </li>
</ul>
  <h3>Les photographies, la musique, les zips. </h3>

  Sans utilisation de mots cl&eacute;s particuliers, le nouvel template &quot;article
  normal&quot; ajoute automatiquement vos documents &agrave; l'article. Musiques, zip ou
  photographies seront g&eacute;r&eacute;s par le template. </li>
<p>En document joint &agrave; l'article,  uploadez des documents photographiques
  de 450 pixels de large pour un fonctionnement optimisé.
  </li>
  Ajoutez de la musique au formats MP3, m3u, wav, WMA, Ogg, FLAC, au, VQF, M4A,
  AIF, RM, RAM, MID. Ajoutez vos PDF Zip et autre documents. L'article normal
  les affichera auomatiquement.</p>
<h3>Le xhtml strict et les css. </h3>
<p>Certaines erreurs doivent persister. L'accessibilit&eacute; n'est pas encore
  parfaite. N&eacute;anmoins 95% des templates  passent le validateur w3c. </p>
<h3>Ce qu'il reste &agrave; faire</h3>

<ul>
  <li>Mise en place serveur d'&eacute;valuation pour passage vers spip1.9</li>
  <li>Updater un fichier php3 manquant? Informez-moi. </li>
  <li>Correction des divers bugs : menu... fonction... </li>
  <li>Modification des formulaires pour plus de conformit&eacute; w3c</li>
  <li>Templates du kiosque (en 1 unique template et &eacute;ventuellement une page de
    recherche)</li>
  <li>Include grandes photos avec les nouveaux plugin javascript.</li>
  <li>Mettre &agrave; jour  l'article normal avec le nouveau plugin exif.</li>
  <li>D&eacute;gager les liens qui ne sont pas encore g&eacute;n&eacute;rique. </li>
  <li>Mettre &agrave; jour avec nouveau plugin spip liste.</li>
  <li>Pr&eacute;voir de passer le tout en spip v2 et remplacer doucement les php3 par
    des php.</li>
  <li>am&eacute;liorer &quot;mon_profil.php3 &quot; avec les nouvelles fonctions de SPIP.</li>
  <li>D&eacute;velopper un script pour avatars avec les nouvelles fonctions et filtres
    spip.  </li>
  <li>... et plein de petites bricoles .</li>
</ul>
<h3>Comment contribuer </h3>
<p>Les templates sont sur <a href="http://zone.spip.org/trac/spip-zone/">SPIP
      zone</a> et peuvent &ecirc;tre modifi&eacute; apr&egrave;s concertation.</p> 
     <ul>
  <li> Installez Tortoise sur votre ordinateur (voir <a href="http://zone.spip.org/trac/spip-zone/wiki/CommentUtiliserSvn">notice</a> sur
    SPIP zone)</li>
  <li> S'inscrire sur <a href="http://listes.rezo.net/mailman/listinfo/spip-zone">http://listes.rezo.net/mailman/listinfo/spip-zone</a></li>
  <li>  Poster une demande de mot de passe sur <a href="mailto:spip-zone[arobase]rezo.net">spip-zone[arobase]rezo.net</a></li>
  <li> Synchronisez vos dossiers avec Tortoise:<br>
    A cette adresse svn, vous trouverez les anciens templates: <br>
svn://zone.spip.org/spip-zone/_squelettes_/_bloog_/bloog <br>
et ici les nouveaux templates qui remplacent les anciens: <br>
svn://zone.spip.org/spip-zone/_squelettes_/_bloog_/bloog_css</li>
  <li>Concertons-nous pour ne pas modifier le m&ecirc;me fichiers en m&ecirc;me temps.</li>
  <li>Avant toutes modifs, mettez &agrave; jour  vos dossiers pour avoir la derni&egrave;re
    version.</li>
  <li>Travaillez &agrave;  votre am&eacute;lioration. </li>
  <li>Montez le tout sur votre serveur pour vos tests.</li>
  <li>V&eacute;rifiez vos modifications dans le validateur w3c.</li>
  <li>Commitez votre modif sur la zone avec Tortoise.</li>
  <li>Recevez un bisou du collectif Spip ;o) </li>
</ul>
     <h3>Une question?</h3>
     Si vous n'&ecirc;tes pas press&eacute;, contactez-moi
       sur <a href="http://www.art-logic.info">www.art-logic.info</a>.<br>
       Soyez tr&egrave;s patient: je
       bosse 10h/jour,
j'anime aussi un collectif artistique <br>
et ai droit moi aussi &agrave; un petit 
week-end de temps
en temps ;o)
<p>&nbsp; </p>
</body>
</html>
