<style type="text/css">
<!--
.Style2 {
	font-size: 13px;
	font-weight: bold;
	font-family: Arial, Helvetica, sans-serif;
	color: #666666;
}
.Style3 {
	font-family: Arial, Helvetica, sans-serif;
	color: #666666;
	font-size: 12px;
}

a:link, 
a:visited
{
	text-decoration: none;
	color: #1E73CD;
}

a:hover,
a:active
{
	text-decoration: underline;
	color: #1E73CD;
}
-->
</style>
<p class="Style2">Blip, un squelette de BLog sous spIP<br>
=============================</p>
<p class="Style3">Codé par Vincent ROBERT ( Site Internet : <a href="http://www.cent20.net">http://www.cent20.net</a> ).</p>
<p class="Style3">Un site internet fonctionnant avec le logiciel libre <a href="http://www.spip.net">SPIP</a>  peut améliorer sa présentation graphique publique en intégrant un squelette, c’est à dire un ensemble de fichier qui organise la manière dont les informations seront affichés sur la partie publique du site.
        
Blip est un squelette conçut pour <a href="http://www.spip.net">SPIP</a>, il est adapté a un usage de type Blog ou weblog.</p>
<p class="Style3"><a href="http://www.cent20.net/article.php3?id_article=32">Plus d'information  sur le squelette Blip en ligne. </a></p>
<p class="Style2"> Licence<br>
  =======</p>
<p class="Style3"> Le code de ce squelette est livré sous licence GPL. Si vous décidez de modifier et / ou de distribuer le squelette Blip, merci d'inclure ce fichier texte.
          
Le fichier <em>licence.txt</em> contenu dans l'archive zip est un exemplaire anglais de la licence GNU / GPL.</p>
<p class="Style2">Installation du squelette Blip <br>
  =======================</p>
<p class="Style3">La procédure d'installation est consultable
<a href="http://www.cent20.net/spikini/?wiki=BlipInstallation">en ligne</a>.</p>
<p class="Style2"> A propos du squelette Blip<br>
  ======================
</p>
<p class="Style3">Ce squelette a été codé sur la base du <a href="http://www.maiis.net">squelette Maiis</a> de Pierre BASSON. Je tiens par ailleurs &agrave; remercier tout particuli&egrave;rement les nombreux utilisateurs des listes de diffusion de spip pour leur aide pr&eacute;cieuse. </p>
<p class="Style3"> L'archive zip contenant le squelette Blip que vous venez de t&eacute;l&eacute;charger est num&eacute;rot&eacute;, un num&eacute;ro sous la forme :<br>
  <strong>[</strong><em>Un chiffre</em><strong>] . [</strong><em>Un nombre &agrave; deux chiffres</em><strong>] [</strong><em>Une extension optionnelle</em><strong>]</strong></p>
<p class="Style3">Le premier chiffre indique la version du squelette.
  Les deux suivants la sous version.</p>
<p class="Style3">Au plus les num&eacute;ros sont &eacute;lev&eacute;s, au plus la version est avanc&eacute;, et donc dispose de fonctionnalit&eacute;.</p>
<p class="Style3">Mais le plus important est l'<em> extension optionnelle</em><strong></strong> :</p>
<ul>
  <li class="Style3"><strong>Pr</strong> signifie pr&eacute;-version, il s'agit donc d'une version pr&eacute;-finalis&eacute;, propos&eacute; en pr&eacute;vision d'une publication ult&eacute;rieure. Ces versions sont en g&eacute;n&eacute;ral stable, mais peuvent n&eacute;anmoins comporter quelques bogues, elles sont distribu&eacute;s pour vous permettre de tester et deboguer. N'h&eacute;sitez pas &agrave; signaler les <a href="http://www.cent20.net/spikini/?wiki=BlipBugs">bugs &eacute;ventuels</a>.</li>
  <li class="Style3"><strong>Pr1</strong>, <strong>Pr2</strong>, <strong>Pr3</strong> sont les versions successives des pr&eacute;-versions, plus le num&eacute;ro est &eacute;lev&eacute;, au plus la version est op&eacute;rationnelle.</li>
</ul>
