<?php

if (!defined('_ECRIRE_INC_VERSION')) return;

$GLOBALS[$GLOBALS['idx_lang']] = array(

// E
'escal_description' => 'Адаптований до версії 3 SPIP і пропонує:
- * конфігурацію, що здійснюється в адміністративній частині;
- * макет, що настроюється, в 2 або 3 колонки за вибором, зі стилями;
- * управління багатомовністю;
- * простий форум в стилі phpBB;
- * широкий вибір меню і навігації, деякі є надлишковими: ідентифікація, меню по горизонталі і/або вертикалі;
- * розташування, фон, колір і зміст легко змінити в бічних блоках;
- * горизонтальне та/або вертикальне меню (2 на вибір), що випадає на регульовану глибину;
- * автоматичне перенаправлення на статтю, якщо вона єдина в своїй рубриці;
- * навігація за ключами;
- * календар і/або список подій;
- * показ останніх статей або об&#39;єктів в рубриці;
- * показ підрубрик і статей на кожній сторінці рубрики;
- * показ форумів, пов&#39;язаних зі статтями;
- * контактна форма для зв&#39;язку електронною поштою;
- * сторінка контактів;
- * карта сайту;
- * RSS-файл для синдикації сайту;
- * спеціальна таблиця стилів для друку статей;
- * зона зв&#39;язку з домашньою сторінкою (2 варіанти перегляду);
- * валідний XHTML Strict 1.0 ',
'escal_slogan' => 'Squelette 2 ou 3 colonnes compos&eacute; de nombreuses noisettes',

);
?>